app/Controllers/BaseController.php

	public function profilecek($random)
	{
		$this->builder = $this->db->table("profile_user");
		$this->builder->where("random",$random);
		$total = $this->builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `profile_user`
WHERE `random` = 'bf26032b154e4368a84c7349164ea9bf1a87e995'